#### Terraform Plan for `prod` 📋 ✅ Success

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_string.suffix: Refreshing state... [id=8y6qy5]
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-prod-jakob]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-prod-jakob/providers/Microsoft.Storage/storageAccounts/stdemoprod8y6qy5]
azurerm_storage_container.demo: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-prod-jakob/providers/Microsoft.Storage/storageAccounts/stdemoprod8y6qy5/blobServices/default/containers/container-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id         = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-prod-jakob"
      - location   = "norwayeast" -> null
      - name       = "rg-demo-prod-jakob" -> null
        tags       = {
            "environment" = "prod"
            "managed_by"  = "terraform"
            "project"     = "demo"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_account.main has been deleted
  - resource "azurerm_storage_account" "main" {
      - id                                 = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-demo-prod-jakob/providers/Microsoft.Storage/storageAccounts/stdemoprod8y6qy5" -> null
      - name                               = "stdemoprod8y6qy5" -> null
      - primary_blob_endpoint              = "https://stdemoprod8y6qy5.blob.core.windows.net/" -> null
        tags                               = {
            "environment" = "prod"
            "managed_by"  = "terraform"
            "project"     = "demo"
        }
        # (96 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rg-demo-prod-jakob"
      + tags     = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "demo"
        }
    }

  # azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Premium"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-demo-prod-jakob"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "demo"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.demo will be created
  + resource "azurerm_storage_container" "demo" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "container-prod"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # random_string.suffix must be replaced
-/+ resource "random_string" "suffix" {
      ~ id          = "8y6qy5" -> (known after apply)
      ~ length      = 6 -> 5 # forces replacement
      ~ result      = "8y6qy5" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ storage_account_endpoint = "https://stdemoprod8y6qy5.blob.core.windows.net/" -> (known after apply)
  ~ storage_account_name     = "stdemoprod8y6qy5" -> (known after apply)
Releasing state lock. This may take a few moments...
```

</details>

**Exit Code:** 0

*Pusher: @jakobop1210, Action: `pull_request`, Workflow: `Terraform CI`*